Revit 2024 API
ImporterIFC.HybridCreateImportMap Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IDictionary<string, ElementId> HybridCreateImportMap(
	Document doc,
	IList<ElementId> elementIds
)
Visual Basic
Public Function HybridCreateImportMap ( _
	doc As Document, _
	elementIds As IList(Of ElementId) _
) As IDictionary(Of String, ElementId)
Visual C++
public:
IDictionary<String^, ElementId^>^ HybridCreateImportMap(
	Document^ doc,
	IList<ElementId^>^ elementIds
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
elementIds
Type: System.Collections.Generic.IList<ElementId>
See Also
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace